In [1]:
import cassandra
print(cassandra.__version__)

3.25.0

In [7]:
from cassandra.cluster import Cluster
from cassandra.auth import PlainTextAuthProvider

cloud_config= {
        'secure_connect_bundle': r'C:\Users\dhana\Downloads\Machine_learning_notes\secure-connect-try1.zip'
}
auth_provider = PlainTextAuthProvider('kgmTSlsZjUmMvqFCMlXzleHk', 'c6,NzyJzmgr+xaxmJs-I_F8BG5w+mB8qAJ1eqo2ePQMCrzdD+,Sds4sZhJKYPw9ilAkQ3kjLbkFcNdwE.DOKEBLZ_gZU+qeD-9ZxJT8zga-cGeDEjUKloqE9sE.WquAx')
cluster = Cluster(cloud=cloud_config, auth_provider=auth_provider)
session = cluster.connect()

row = session.execute("select release_version from system.local")
print(row)

<cassandra.cluster.ResultSet object at 0x0000010A1E7F0CF8>

In [11]:
# create keyspace in database
#row = session.execute("CREATE KEYSPACE try1 WITH replication = {'class': 'SimpleStrategy', 'replication_factor' : 4};")

In [12]:
#use keyspace
row=session.execute("use try1;")

In [13]:
#creating table in the keyspace
row=session.execute("CREATE TABLE Members(id int PRIMARY KEY,name text,age int,height int);")

In [14]:
#inserting into table
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (1,'mohit',25,160);")

In [15]:
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (2,'shubham',26,165);")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (3,'aradhana',25,142);")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (4,'rakesh',55,157);")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (5,'poonam',52,145);")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (6,'seema',30,145);")

In [16]:
#view the data in table
row=session.execute("select * from Members;")
for i in row:
    print(i)

Row(id=5, age=52, height=145, name='poonam')
Row(id=1, age=25, height=160, name='mohit')
Row(id=2, age=26, height=165, name='shubham')
Row(id=4, age=55, height=157, name='rakesh')
Row(id=6, age=30, height=145, name='seema')
Row(id=3, age=25, height=142, name='aradhana')

In [17]:
#alter existing table (adding more columns to table)
row=session.execute("ALTER TABLE Members ADD email varchar;")

In [18]:
row=session.execute("select * from Members;")
for i in row:
    print(i)

Row(id=5, age=52, email=None, height=145, name='poonam')
Row(id=1, age=25, email=None, height=160, name='mohit')
Row(id=2, age=26, email=None, height=165, name='shubham')
Row(id=4, age=55, email=None, height=157, name='rakesh')
Row(id=6, age=30, email=None, height=145, name='seema')
Row(id=3, age=25, email=None, height=142, name='aradhana')

In [19]:
#truncating (removing all data from table)
row=session.execute("TRUNCATE Members;")

In [20]:
row=session.execute("select * from Members;")
for i in row:
    print(i)

In [21]:
#dropping the table
row=session.execute("DROP TABLE if exists Member;")

In [22]:
#table is empty now
for i in row:
    print(i)

In [23]:
row=session.execute("INSERT INTO Members(id,name,age,height,email) VALUES (2,'shubham',26,165,'memohit@gmail.com');")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (3,'aradhana',25,142);")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (4,'rakesh',55,157);")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (5,'poonam',52,145);")
row=session.execute("INSERT INTO Members(id,name,age,height) VALUES (6,'seema',30,145);")

In [24]:
#update existing table 
row=session.execute("UPDATE try1.Members SET name= 'Mohit Raghav',age = 28 WHERE id=1;")

In [25]:
#view the data in table 
row=session.execute("select * from Members;")
for i in row:
    print(i)

Row(id=5, age=52, email=None, height=145, name='poonam')
Row(id=1, age=28, email=None, height=None, name='Mohit Raghav')
Row(id=2, age=26, email='memohit@gmail.com', height=165, name='shubham')
Row(id=4, age=55, email=None, height=157, name='rakesh')
Row(id=6, age=30, email=None, height=145, name='seema')
Row(id=3, age=25, email=None, height=142, name='aradhana')

In [26]:
#delete a particular row or a part of row
row=session.execute("DELETE age FROM Members WHERE id=3;")

In [27]:
#view the data in table 
row=session.execute("select * from Members;")
for i in row:
    print(i)

Row(id=5, age=52, email=None, height=145, name='poonam')
Row(id=1, age=28, email=None, height=None, name='Mohit Raghav')
Row(id=2, age=26, email='memohit@gmail.com', height=165, name='shubham')
Row(id=4, age=55, email=None, height=157, name='rakesh')
Row(id=6, age=30, email=None, height=145, name='seema')
Row(id=3, age=None, email=None, height=142, name='aradhana')

In [28]:
#selecting particular data
row=session.execute("SELECT name, age FROM Members WHERE id = 1;")

for i in row:
    print(i)

Row(name='Mohit Raghav', age=28)

In [ ]:
'''
import csv
with open('cric.csv','r') as data:
    next(data)
    data_csv= csv.reader(data,delimiter=',')
    #csv reader object
    print(data_csv)
    all_value= []
    for i in data_csv:
        session.execute("insert into ineuro.dataa (idd,first_name,last_name) values(%s,%s,%s)",[int(i[0]),i[1],i[2]])
print('Finished')
'''